first_start='Привет\n\n\
Мы разработали бота для выбора и анализа ниши товара, чтобы ты смог выбрать прибыльную и конкурентоспособную нишу, где результат будет сделать легче всего.\n\n\
Бот будет полезен тем, кто\n\
👉🏻 только собирается выходить на маркетплейс и выбирает нишу\n\
👉🏻 опытным селлерам, которые хотят выйти с новым товаром'


start_text = "⚠️Чтобы бот подобрал ниши для выхода на маркетплейс,\n\
тебе необходимо задать параметры выборки.\n\n\
Всего 7 параметров. Чтобы сформировать выборку, необходимо задать минимум 5.\n\n\
Следуй инструкциям бота и в конце получишь персональную подборку в таблице из 100 подходящих тебе товаров для работы на Wildberries.\n\n\
👉🏻 Жми кнопку ниже, чтобы начать"

question_season_text = '❓Для начала, выбери сезон для анализа:\n\n\
Параметр влияет на то, какой сезон будет анализироваться.\n\
Если рассматриваешь сезонные товары - жми сезон.\n\
Если рассматриваешь товары, которые продаются всегда - жми прошлый месяц'

season_spring_btn = '▫️Весенний сезон'
season_summer_btn = '▫️Летний сезон'
season_autumn_btn = '▫️Осенний сезон'
season_winter_btn = '▫️Зимний сезон'
last_month_btn = '▫️Прошлый месяц'
last_year_btn = '▫️Прошлый год'


question_avr_check_text = '1/7\n\n\
Теперь, определим диапазон цен для подбора товара.\n\
❓Укажи средний <strong>минимальный</strong> чек товара в рублях, который ты  хотел бы продавать\n\n\
Пример: 1500'
question_max_check_text ='2/7\n\n\
❓Укажи <strong>максимальный</strong> средний чек товара в рублях, который ты хотел бы продавать\n\n\
Пример: 3500'

skip_quest_btn = 'Пропустить вопрос'

question_max_count_text = '3/7\n\n\
❓Выбери по кнопкам ниже или напиши <strong>максимальное</strong> количество товаров конкурентов в категории\n\n\
От этого параметра зависит уровень конкуренции в нише, которую подберет бот'

question_min_redemption_text = '4/7\n\n\
❓Выбери  по кнопкам ниже или напиши <strong>минимальный</strong> % выкупа.\n\n\
Параметр указывает, какой процент в нише покупатели выкупают с пункта выдачи заказов. Чем больше % выкупа, тем меньше потребуется вложений для захода в нишу.'

question_proc_sale_text = '5/7\n\n\
❓ Выбери или напиши % товара с продажами.\n\n\
Параметр задает процент товаров в нише, которые имеют продажи каждый месяц'

question_proc_missrvenue_text = '6/7\n\n\
❓ Выбери по кнопкам ниже или напиши <strong>минимальный</strong> % упущенной выручки.\n\n\
Это выручка, которую не получили продавцы из-за отсутствия товара на складах.'

question_proc_turnover_text = '7/7\n\n\
❓Выбери по кнопкам ниже или напиши <strong>минимальный</strong> % оборачиваемости\n\n\
Параметр определяет, сколько процентов от остатка будет продано за месяц.\n\n\
100%: весь товар в нише продается за месяц\n\
70%: весь товар в нише продается за 1,4 месяца\n\
50%: весь товар в нише продается за 2 месяца\n\
20%: весь товар в нише продается за 5 месяцев'

report_wait='Все данные получены, отчет формируется.\n\n\
Пожалуйста, подожди минуту и я пришлю его в этот чат'

question_skip='⚠️ Для формирования отчета необходимо задать минимум  5 параметров.\n\n\
 Пожалуйста, задай параметры, которые ты пропустил:'

report_text='Если у вас возникли вопросы или нужна помощь с таблицей, напишите мне @ilyalikhopoy'

subscribe='''⚠️ Чат-бот совершенно бесплатный, но для дальнейшего использования прошу подписаться на мой канал: https://t.me/+IN0lZonOmRk2ZTBi\n\nРассказываю на своем примере, как выбрать товар для маркетплейса, вырасти без долгой тягомотины и продавать на миллионы.\n\n
👉🏻  Нажми кнопку продолжить, чтобы проверить подписку'''

choose_clothes="""
❓Какую нишу будем рассматривать ?

В текущей версии бота можно проанализировать отдельно  товары или сделать анализ по всем нишам сразу.
"""

choose_clothes_type = "ℹ️ Выберите категорию одежды."
